[
    {
        "title": "Breaking: Drake, Ice Spice en Diddy in Bizarre Studio Clash!",
        "text": "Drake, Ice Spice en Diddy raakten in een heftige ruzie toen Diddy een 'speciale' cocktail aanbood aan Ice Spice. Drake vond dit ongepast en sloeg een microfoon kapot. Ice Spice riep via Instagram dat het 'crazy' was. Fans speculeren of het een publiciteitsstunt is.",
        "image": "https://i.pinimg.com/736x/f6/8f/87/f68f87873b87b29a31c7ea12e66a4263.jpg",
        "real": false
    },
    {
        "title": "Schokkend: Nieuwe 'Onzichtbare' Drug Duikt Op in Europa!",
        "text": "De drug 'Phantom X' is bijna ondetecteerbaar en verdwijnt snel uit het lichaam. Het geeft euforie en hallucinaties, maar wordt niet gevonden bij standaard tests. Experts waarschuwen voor een nieuwe bedreiging voor Europa.",
        "image": "https://i.pinimg.com/736x/00/a8/42/00a8422d08127e84e319507f77727bfd.jpg",
        "real": false
    },
    {
        "title": "Playboi Carti Dropt Plotseling Nieuw Album - Fans in Shock!",
        "text": "Playboi Carti dropte zonder aankondiging het album 'MUSIC 666'. Het is experimenteel en duister, met gastbijdragen van Kanye, Travis Scott en Lil Uzi Vert. Fans reageren verbaasd over de mysterieuze stijl en geheime boodschappen.",
        "image": "https://i.pinimg.com/736x/4e/a8/19/4ea8199ed5dbb4b405354c3889e3e7a6.jpg",
        "real": false
    },
    {
        "title": "Fortnite-spelers ontdekken mysterieuze bunker na laatste update",
        "text": "Na de laatste Fortnite-update ontdekten spelers een mysterieuze bunker bij Shady Stilts. De ingang is deels ingestort, maar geluiden van binnen wekken nieuwsgierigheid over een mogelijk live-event of oude verhaallijn.",
        "image": "https://i.pinimg.com/736x/30/66/3b/30663ba5ca15511b729771398cda00e0.jpg",
        "real": false
    },
    {
        "title": "Rockstar werkt in stilte aan geheime online modus voor GTA 6",
        "text": "Rockstar ontwikkelt 'GTA World', een nieuwe online modus voor GTA 6. In deze modus bouwen spelers hun eigen leven in Vice City zonder vaste missies. Dit zou verder gaan dan GTA Online met een dynamische wereld.",
        "image": "https://i.ytimg.com/vi/Q83wMDW_lwA/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLAj0wsIaxkQTLLRiQ02oiQx8MBj4A",
        "real": false
    },
    {
        "title": "Vier Canadezen geëxecuteerd in China, Canada vroeg tevergeefs om gratie",
        "text": "China executeerde vier Canadese burgers die veroordeeld waren voor drugsdelicten. Ondanks een verzoek van de Canadese regering, werd gratie geweigerd. De zaak heeft de gespannen relatie tussen de landen verder verergerd.",
        "image": "https://cdn.nos.nl/image/2025/03/20/1204991/1024x576a.jpg",
        "real": true
    },
    {
        "title": "Apple en Google overtreden Europese wet digitale markt",
        "text": "Google en Apple overtreden de Digital Markets Act door voorrang te geven aan hun eigen diensten. De Europese Commissie onderzoekt deze overtredingen en waarschuwt voor boetes als de bedrijven zich niet aanpassen.",
        "image": "https://cdn.nos.nl/image/2025/03/19/1204948/1024x576a.jpg",
        "real": true
    },
    {
        "title": "Tupac's Erven Boos Over AI-Nummer van Drake",
        "text": "De erven van Tupac Shakur dreigen juridische stappen te ondernemen tegen Drake voor het gebruik van Tupac’s stem in een AI-gegenereerd nummer. Ze beschouwen het als een schending van de nalatenschap van Tupac.",
        "image": "https://images.nu.nl/m/ktuxez3a2vf7_wd854/0/0/1946/1095/erven-tupac-shakur-boos-op-drake-vanwege-nabootsen-stem-met-ai.jpg",
        "real": true
    },
    {
        "title": "Pentagon mag transgender personen voorlopig niet weren uit het leger",
        "text": "Een federale rechter oordeelde dat het Pentagon transgender personen niet mag weren, na een decreet van president Trump. Het arrest was een overwinning voor de transgender militairen, maar de zaak loopt nog.",
        "image": "https://cdn.nos.nl/image/2025/03/19/1204826/1024x576a.jpg",
        "real": true
    },
    {
        "title": "Hongarije neemt wet aan die Pride-mars verbiedt",
        "text": "Het Hongaarse parlement verbood de Pride-mars in Boedapest onder de nieuwe wet die vrijheid van vergadering inperkt als het tegen de bescherming van kinderen ingaat. De wet heeft geleid tot protesten, maar de Pride-organisatie wil doorgaan met de mars.",
        "image": "https://cdn.nos.nl/image/2025/03/18/1204516/1024x576a.jpg",
        "real": true
    }
]
